app/Http/Controllers/ProductoxController.php

    public function edit($id)
    {
        $producto = Producto::FindOrfail($id);
        $proveedores = Proveedor::select('id', 'nombre')->get();
        $bodegas = Cellar::select('id', 'nombre')->get();
---
select `id`, `nombre` from `proveedors`
select `id`, `nombre` from `cellars`

    public function create()
    {
        $proveedores = Proveedor::select('id', 'nombre')->get();
        $bodegas = Cellar::select('id', 'nombre')->get();
---
select `id`, `nombre` from `proveedors`
select `id`, `nombre` from `cellars`