app/Http/Controllers/VentaController.php

select * from `detalles` where `detalles`.`venta_id` = 27 and `detalles`.`venta_id` is not null
---
                    ]);
                }

                $detalles = $venta->detalles()->get();

delete from `ventas` where `id` = 13
---
    public function destroy($id)
    {
        if (request()->expectsJson()) {
            try {
                //TODO arreglar esto
                $producto = Venta::findOrFail($id);
                // if (count($producto->services()->get()) != 0) {
                //     return response()->json('Existen equipos asocciados', 400);
                // }
                $producto->delete();